; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=144, out_folder=htg/blocksworld/training, instance_id=8, seed=2032, goal_proportion=0.03

(define (problem blocksworld-08)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 - object)
 (:init 
    (arm-empty)
    (clear b79)
    (on b79 b138)
    (on b138 b131)
    (on b131 b72)
    (on b72 b2)
    (on b2 b144)
    (on b144 b12)
    (on b12 b4)
    (on b4 b123)
    (on-table b123)
    (clear b137)
    (on b137 b61)
    (on b61 b107)
    (on b107 b54)
    (on b54 b130)
    (on-table b130)
    (clear b63)
    (on b63 b37)
    (on b37 b10)
    (on b10 b48)
    (on b48 b8)
    (on b8 b21)
    (on-table b21)
    (clear b29)
    (on b29 b34)
    (on b34 b126)
    (on-table b126)
    (clear b52)
    (on b52 b112)
    (on b112 b42)
    (on b42 b56)
    (on b56 b73)
    (on b73 b13)
    (on b13 b35)
    (on b35 b68)
    (on b68 b117)
    (on b117 b6)
    (on b6 b22)
    (on b22 b25)
    (on b25 b60)
    (on b60 b30)
    (on b30 b111)
    (on-table b111)
    (clear b113)
    (on b113 b135)
    (on b135 b71)
    (on-table b71)
    (clear b116)
    (on-table b116)
    (clear b99)
    (on-table b99)
    (clear b38)
    (on b38 b40)
    (on-table b40)
    (clear b115)
    (on b115 b47)
    (on-table b47)
    (clear b129)
    (on-table b129)
    (clear b74)
    (on b74 b50)
    (on b50 b93)
    (on b93 b106)
    (on b106 b66)
    (on-table b66)
    (clear b49)
    (on b49 b133)
    (on b133 b83)
    (on b83 b64)
    (on b64 b32)
    (on b32 b120)
    (on b120 b14)
    (on b14 b86)
    (on b86 b58)
    (on-table b58)
    (clear b101)
    (on-table b101)
    (clear b127)
    (on b127 b80)
    (on b80 b109)
    (on b109 b57)
    (on-table b57)
    (clear b45)
    (on b45 b69)
    (on b69 b24)
    (on-table b24)
    (clear b20)
    (on b20 b142)
    (on b142 b28)
    (on-table b28)
    (clear b94)
    (on b94 b104)
    (on b104 b124)
    (on b124 b141)
    (on-table b141)
    (clear b114)
    (on b114 b7)
    (on-table b7)
    (clear b15)
    (on b15 b23)
    (on-table b23)
    (clear b3)
    (on b3 b89)
    (on-table b89)
    (clear b125)
    (on-table b125)
    (clear b65)
    (on b65 b96)
    (on b96 b103)
    (on b103 b97)
    (on-table b97)
    (clear b91)
    (on b91 b55)
    (on b55 b1)
    (on b1 b33)
    (on b33 b110)
    (on b110 b82)
    (on b82 b19)
    (on b19 b67)
    (on b67 b85)
    (on b85 b5)
    (on b5 b88)
    (on b88 b17)
    (on b17 b51)
    (on b51 b98)
    (on b98 b76)
    (on b76 b100)
    (on b100 b26)
    (on b26 b43)
    (on b43 b134)
    (on b134 b122)
    (on b122 b140)
    (on-table b140)
    (clear b44)
    (on b44 b132)
    (on-table b132)
    (clear b16)
    (on b16 b102)
    (on-table b102)
    (clear b121)
    (on-table b121)
    (clear b81)
    (on b81 b36)
    (on b36 b128)
    (on b128 b18)
    (on b18 b78)
    (on b78 b136)
    (on-table b136)
    (clear b27)
    (on-table b27)
    (clear b90)
    (on-table b90)
    (clear b105)
    (on b105 b84)
    (on b84 b75)
    (on b75 b87)
    (on b87 b95)
    (on b95 b70)
    (on b70 b108)
    (on b108 b62)
    (on-table b62)
    (clear b77)
    (on b77 b139)
    (on b139 b39)
    (on b39 b118)
    (on b118 b53)
    (on b53 b11)
    (on b11 b92)
    (on b92 b41)
    (on-table b41)
    (clear b46)
    (on b46 b59)
    (on b59 b143)
    (on-table b143)
    (clear b31)
    (on-table b31)
    (clear b119)
    (on b119 b9)
    (on-table b9))
 (:goal  (and 
    (clear b3)
    (on-table b3)
    (clear b1)
    (on b1 b2)
    (on-table b2)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b3 b89)
   deleted: (on b3 b89) (clear b3) (arm-empty)
   added: (holding b3) (clear b89)
   goals met: 0 of 7
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 7
3. (unstack b79 b138)
   deleted: (on b79 b138) (clear b79) (arm-empty)
   added: (holding b79) (clear b138)
   goals met: 2 of 7
4. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 2 of 7
5. (unstack b138 b131)
   deleted: (on b138 b131) (clear b138) (arm-empty)
   added: (holding b138) (clear b131)
   goals met: 2 of 7
6. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 2 of 7
7. (unstack b131 b72)
   deleted: (on b131 b72) (clear b131) (arm-empty)
   added: (holding b131) (clear b72)
   goals met: 2 of 7
8. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 2 of 7
9. (unstack b72 b2)
   deleted: (on b72 b2) (clear b72) (arm-empty)
   added: (holding b72) (clear b2)
   goals met: 2 of 7
10. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 2 of 7
11. (unstack b2 b144)
   deleted: (on b2 b144) (clear b2) (arm-empty)
   added: (holding b2) (clear b144)
   goals met: 2 of 7
12. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 3 of 7
13. (unstack b144 b12)
   deleted: (on b144 b12) (clear b144) (arm-empty)
   added: (holding b144) (clear b12)
   goals met: 3 of 7
14. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 3 of 7
15. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 4 of 7
16. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 7
17. (unstack b4 b123)
   deleted: (on b4 b123) (clear b4) (arm-empty)
   added: (holding b4) (clear b123)
   goals met: 3 of 7
18. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 7
19. (unstack b91 b55)
   deleted: (on b91 b55) (clear b91) (arm-empty)
   added: (holding b91) (clear b55)
   goals met: 5 of 7
20. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 5 of 7
21. (unstack b55 b1)
   deleted: (on b55 b1) (clear b55) (arm-empty)
   added: (holding b55) (clear b1)
   goals met: 6 of 7
22. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 6 of 7
23. (unstack b1 b33)
   deleted: (on b1 b33) (clear b1) (arm-empty)
   added: (holding b1) (clear b33)
   goals met: 5 of 7
24. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 7 of 7
